mcu8rookie/Personal_NRF51822_Porj/NRF51_I2C/UsrCode/Usr_I2C.c
#ifndef __USR_I2C_C__
#define __USR_I2C_C__

#include <stdio.h>
#include <stdint.h>
#include "twi_master.h"
#include "Usr_I2C.h"
#include <stdint.h>
#include "Usr_Code.h"
#include "nrf_delay.h"

//#define DEF_I2C_ADDR_7B     (0x12)
//#define DEF_I2C_ADDR_7B     (0x50)      // PSF PVC Address;
//#define DEF_I2C_ADDR_7B     (0x98>>1)
#define DEF_I2C_ADDR_7B     (0x13)      // For PGS7000_V1.0 or E1-PGS7000 Address;

//#define DEF_I2C_ADDR_7B     (0x28)      // For FS3000 or PAV3000 Address;


#define DEF_I2C_ADDR_WT     ((DEF_I2C_ADDR_7B<<1)+0)
#define DEF_I2C_ADDR_RD     ((DEF_I2C_ADDR_7B<<1)+1)

#define DEF_I2C_BUFF_MUM    (64)

uint8_t i2c_wt_len;
uint8_t i2c_rd_len;

uint8_t i2cBuff[DEF_I2C_BUFF_MUM];

void Usr_I2C_InitSetup(void)
{
    twi_master_init();
}


#if 1
bool twi_master_transfer(uint8_t   address,
                         uint8_t * data,
                         uint8_t   data_length,
                         bool      issue_stop_condition);
#endif



void Usr_I2C_MainLoop(unsigned char dat)
{
    uint8_t i;
    
    static uint32_t ml_cnt = 0;
    
    uint8_t rtn = 0;
    
    uint8_t cal_crc1;
    //uint8_t cal_crc2;
    
    if(dat == 'w')
    {
        ml_cnt ++;
        
        i2cBuff[0] = 0xD0;
        i2cBuff[1] = ml_cnt;
        i2cBuff[2] = ml_cnt>>8;
        i2cBuff[3] = 0x03;
        i2cBuff[4] = ml_cnt>>8;
        i2cBuff[5] = ml_cnt;
        i2c_wt_len = 6;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,6,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nWrite HEX  0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X,",i2cBuff[0],i2cBuff[1],i2cBuff[2],i2cBuff[3],i2cBuff[4],i2cBuff[5]);
            printf("\t\tData1,\t%d,\tData2,\t%d,",(i2cBuff[1]<<8)+i2cBuff[2],(i2cBuff[4]<<8)+i2cBuff[5]);
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
    }
    else if(dat == 'r')
    {   
        #if 0
        //ml_cnt ++;
        
        //i2cBuff[0] = 0xD0;
        
        i2cBuff[0] = 0xE2;
        
        i2c_wt_len = 1;
        
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_ISSUE_STOP);
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,6,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nRead0 HEX  0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X,",i2cBuff[0],i2cBuff[1],i2cBuff[2],i2cBuff[3],i2cBuff[4],i2cBuff[5]);
            printf("\t\tData1,\t%d,\tData2,\t%d,",(i2cBuff[1]<<8)+i2cBuff[2],(i2cBuff[4]<<8)+i2cBuff[5]);
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    
        
        #if 1
        //ml_cnt ++;
        
        //i2cBuff[0] = 0xD0;
        
        i2cBuff[0] = 0xEC;
        i2cBuff[1] = 0x05;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,2,TWI_ISSUE_STOP);
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,18,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead1 HEX, ");
            
            for(i=0;i<18;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == 'R')
    {
        #if 0
        //ml_cnt ++;
        
        //i2cBuff[0] = 0xD0;
        
        i2cBuff[0] = 0xE2;
        
        i2c_wt_len = 1;
        
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_ISSUE_STOP);
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,6,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nRead1 HEX  0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X,",i2cBuff[0],i2cBuff[1],i2cBuff[2],i2cBuff[3],i2cBuff[4],i2cBuff[5]);
            printf("\t\tData1,\t%d,\tData2,\t%d,",(i2cBuff[1]<<8)+i2cBuff[2],(i2cBuff[4]<<8)+i2cBuff[5]);
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
        
        #if 1
        //ml_cnt ++;
        
        //i2cBuff[0] = 0xD0;
        
        i2cBuff[0] = 0x36;
        i2cBuff[1] = 0x15;
        
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,2,TWI_ISSUE_STOP);
        
        i2cBuff[0] = 0xEC;
        i2cBuff[1] = 0x05;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,2,TWI_ISSUE_STOP);
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,18,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead1 HEX, ");
            
            for(i=0;i<18;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == '1')
    {
        
        #if 1
        
        i2cBuff[0] = 0x36;
        i2cBuff[1] = 0x15;
        
        i2c_wt_len = 2;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2cBuff[0] = 0xEC;
        i2cBuff[1] = 0x05;
        
        i2c_wt_len = 2;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 18;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead1 HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == '2')
    {   
        
        #if 1
        
        i2cBuff[0] = 0xEC;
        i2cBuff[1] = 0x05;
        
        i2c_wt_len = 2;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,1,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 18;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead2 HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == '3')
    {   // Write;
        
        #if 1
        
