mcu8rookie/Personal_NRF51822_Porj/NRF51_I2C/UsrCode/Usr_I2C.c
        i2cBuff[0] = 0x36;
        i2cBuff[1] = 0x08;
        i2cBuff[2] = 0x00;
        i2cBuff[3] = 0x19;
        //i2cBuff[4] = 0x5A;
        
        {
            uint8_t cal_crc1;
            //uint8_t cal_crc2;
            cal_crc1 = sensirion_common_generate(i2cBuff+2,2);
            //cal_crc2 = compute_crc8(i2cBuff+2,2);
            //printf("\ncrc1 = 0x%02X,\tcrc2 = 0x%02X, ",cal_crc1,cal_crc2);
            
            i2cBuff[4] = cal_crc1;
        }
        
        i2c_wt_len = 5;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nWrite3 HEX, ");
            
            for(i=0;i<i2c_wt_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == '4')
    {   // Write;
        
        #if 1
        
        i2cBuff[0] = 0x36;
        i2cBuff[1] = 0x03;
        
        i2c_wt_len = 2;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nWrite4 HEX, ");
            
            for(i=0;i<i2c_wt_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    
    else if(dat == '5')
    {   // Read;
        
        #if 1
        
        i2cBuff[0] = 0x36;
        i2cBuff[1] = 0x15;
        
        i2c_wt_len = 2;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_DONT_ISSUE_STOP);
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2cBuff[0] = 0xEC;
        i2cBuff[1] = 0x05;
        
        i2c_wt_len = 2;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_DONT_ISSUE_STOP);
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 18;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead5 HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == '6')
    {   // Read;
        
        #if 1
        
        i2cBuff[0] = 0xEC;
        i2cBuff[1] = 0x05;
        
        i2c_wt_len = 2;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_DONT_ISSUE_STOP);
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 18;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead6 HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    #if 1
    else if(dat == 'a')     // Write SN;
    {   // Write;
        
        #if 1
        
        i2cBuff[0] = 0x11;
        i2cBuff[1] = 0x88;
        
        for(i2c_wt_len=2;i2c_wt_len<14;i2c_wt_len++)
        {
            i2cBuff[i2c_wt_len] = YearMonthDateSN[i2c_wt_len-2];
        }
        
        cal_crc1 = compute_crc8(i2cBuff+2,2);
        *(i2cBuff+2+2) = cal_crc1;
        
        cal_crc1 = compute_crc8(i2cBuff+2+3,2);
        *(i2cBuff+2+2+3) = cal_crc1;
        
        cal_crc1 = compute_crc8(i2cBuff+2+3+3,2);
        *(i2cBuff+2+2+3+3) = cal_crc1;
        
        cal_crc1 = compute_crc8(i2cBuff+2+3+3+3,2);
        *(i2cBuff+2+2+3+3+3) = cal_crc1;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nWrite a HEX, ");
            
            for(i=0;i<i2c_wt_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == 'b')     // Read SN;
    {   // Read;
        
        #if 1
        
        i2cBuff[0] = 0x11;
        i2cBuff[1] = 0x08;
        
        i2c_wt_len = 2;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 12;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead b HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == 'c')     // Read Raw;
    {   // Read;
        
        #if 1
        
        i2cBuff[0] = 0x10;
        i2cBuff[1] = 0x01;
        
        i2c_wt_len = 2;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 9;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead c HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == 'd')     // Read TempCompPara;
    {   // Read TmprCmpPara;
        
        #if 1
        
        i2cBuff[0] = 0x11;
        i2cBuff[1] = 0x09;
        
        i2c_wt_len = 2;
        
