mcu8rookie/Personal_NRF51822_Porj/NRF51_I2C/UsrCode/Usr_I2C.c
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 24;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead d HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == 'e')     // Write TmprCompPara;
    {   // Write TmprCompPara;
        
        uint32_t Tmp_k;
        #if 1
        
        i2cBuff[0] = 0x11;
        i2cBuff[1] = 0x89;
        
        
        #if 1
        
        // P0
        // Tmp_k = 0x11111111;
        Tmp_k = 0xC394A800;
        
        i2cBuff[2] = Tmp_k>>24;
        i2cBuff[3] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*0,2);
        *(i2cBuff+2+2+3*0) = cal_crc1;
        
        i2cBuff[5] = Tmp_k>>8;
        i2cBuff[6] = Tmp_k>>0;
        cal_crc1 = compute_crc8(i2cBuff+2+3*1,2);
        *(i2cBuff+2+2+3*1) = cal_crc1;
        
        // P1
        Tmp_k = 0xC394A800;
        
        i2cBuff[8] = Tmp_k>>24;
        i2cBuff[9] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*2,2);
        *(i2cBuff+2+2+3*2) = cal_crc1;
        
        i2cBuff[11] = Tmp_k>>8;
        i2cBuff[12] = Tmp_k>>0;
        cal_crc1 = compute_crc8(i2cBuff+2+3*3,2);
        *(i2cBuff+2+2+3*3) = cal_crc1;
        
        // P2
        Tmp_k = 0xC394A800;
        
        i2cBuff[14] = Tmp_k>>24;
        i2cBuff[15] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*4,2);
        *(i2cBuff+2+2+3*4) = cal_crc1;
        
        i2cBuff[17] = Tmp_k>>8;
        i2cBuff[18] = Tmp_k>>0;
        cal_crc1 = compute_crc8(i2cBuff+2+3*5,2);
        *(i2cBuff+2+2+3*5) = cal_crc1;
        
        // P3
        Tmp_k = 0xC394A800;
        
        i2cBuff[20] = Tmp_k>>24;
        i2cBuff[21] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*6,2);
        *(i2cBuff+2+2+3*6) = cal_crc1;
        
        i2cBuff[23] = Tmp_k>>8;
        i2cBuff[24] = Tmp_k>>0;
        
        #endif
        
        
        #if 0
        // P0
        Tmp_k = 0x11111111;
        
        i2cBuff[2] = Tmp_k>>24;
        i2cBuff[3] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*0,2);
        *(i2cBuff+2+2+3*0) = cal_crc1;
        
        i2cBuff[5] = Tmp_k>>8;
        i2cBuff[6] = Tmp_k>>0;
        cal_crc1 = compute_crc8(i2cBuff+2+3*1,2);
        *(i2cBuff+2+2+3*1) = cal_crc1;
        
        // P1
        Tmp_k = 0x22222222;
        
        i2cBuff[8] = Tmp_k>>24;
        i2cBuff[9] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*2,2);
        *(i2cBuff+2+2+3*2) = cal_crc1;
        
        i2cBuff[11] = Tmp_k>>8;
        i2cBuff[12] = Tmp_k>>0;
        cal_crc1 = compute_crc8(i2cBuff+2+3*3,2);
        *(i2cBuff+2+2+3*3) = cal_crc1;
        
        // P2
        Tmp_k = 0x33333333;
        
        i2cBuff[14] = Tmp_k>>24;
        i2cBuff[15] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*4,2);
        *(i2cBuff+2+2+3*4) = cal_crc1;
        
        i2cBuff[17] = Tmp_k>>8;
        i2cBuff[18] = Tmp_k>>0;
        cal_crc1 = compute_crc8(i2cBuff+2+3*5,2);
        *(i2cBuff+2+2+3*5) = cal_crc1;
        
        // P3
        Tmp_k = 0x44444444;
        
        i2cBuff[20] = Tmp_k>>24;
        i2cBuff[21] = Tmp_k>>16;
        cal_crc1 = compute_crc8(i2cBuff+2+3*6,2);
        *(i2cBuff+2+2+3*6) = cal_crc1;
        
        i2cBuff[23] = Tmp_k>>8;
        i2cBuff[24] = Tmp_k>>0;
        #endif
        
        cal_crc1 = compute_crc8(i2cBuff+2+3*7,2);
        *(i2cBuff+2+2+3*7) = cal_crc1;
        
        i2c_wt_len = 26;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nWrite e HEX, ");
            
            for(i=0;i<i2c_wt_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == 'f')     
    {   // Read DC_Y;
        
        #if 1
        
        i2cBuff[0] = 0x11;
        i2cBuff[1] = 0x11;
        
        i2c_wt_len = 2;
        
        //rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_DONT_ISSUE_STOP);
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        i2c_rd_len = 3;
        
        rtn |= twi_master_transfer(DEF_I2C_ADDR_RD,i2cBuff,i2c_rd_len,TWI_ISSUE_STOP);
        
        
        if(true == rtn)
        {
            printf("\nRead d HEX, ");
            
            for(i=0;i<i2c_rd_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
        #endif
    }
    else if(dat == 'g')     
    {   // Write DC_Y;
        
        uint32_t Tmp;
        
        i2cBuff[0] = 0x11;
        i2cBuff[1] = 0x91;
        
        // DC_Y = 0x1122;
        Tmp = ml_cnt++;
        
        i2cBuff[2] = Tmp>>0;
        i2cBuff[3] = Tmp>>0;
        cal_crc1 = compute_crc8(i2cBuff+2+3*0,2);
        *(i2cBuff+2+2+3*0) = cal_crc1;
        
        i2c_wt_len = 5;
        
        rtn = twi_master_transfer(DEF_I2C_ADDR_WT,i2cBuff,i2c_wt_len,TWI_ISSUE_STOP);
        
        if(true == rtn)
        {
            printf("\nWrite e HEX, ");
            
            for(i=0;i<i2c_wt_len;i++)
            {
                printf("\t0x%02X,",i2cBuff[i]);
            }
        }
        else
        {
            printf("\nI2C: Erroe, twi_master_transfer(); return %d,",rtn);
        }
    }
    #endif
    
    #if 1
    else if(dat == 'h')     
    {   // Read Firmware version;
        
        #if 1
        
        i2cBuff[0] = 0xD5;
        
